<template>
  <div>
    <p
      class="text-h5 text-md-h4 text-center pa-0 ma-0 title-custom"
      style="font-family: 'IBM Plex Mono' !important"
    >
      ЭТАПЫ РАЗРАБОТКИ
    </p>

    <v-row align="start" justify="center" class="mx-4 mt-4">
      <v-col
        cols="12"
        xs="12"
        sm="12"
        md="6"
        v-for="step in devsteps"
        :key="step.title"
      >
        <DevStepCard
          :id="step.id"
          :title="step.title"
          :description="step.description"
        />
      </v-col>
    </v-row>
  </div>
</template>

<script setup lang="ts">
import { ref } from 'vue';
import DevStepCard from './DevStepCard.vue';

const devsteps = ref([
  {
    id: 1,
    title: 'Разработка технического задания',
    description:
      'Включает в себя все пожелания заказчика, определение потребностей конечных пользователей. В итоге все функциональные и технические требования прописываются в техническом задании, на котором основывается разработка.',
  },
  {
    id: 2,
    title: 'Прототипирование',
    description:
      'Этап, который включает в себя создание понятного и удобного интерфейса. В результате получаем рабочий прототип, отражающий основные функции и логику (программного обеспечения/сайта).',
  },
  {
    id: 3,
    title: 'Создание дизайна',
    description:
      'Подразумевает под собой разработку адаптивного макета в соответствии с разработанной структурой и логикой, а также стилевыми пожеланиями Заказчика. Уникальный дизайн улучшает восприятие текстовой информации и повышает узнаваемость бренда.',
  },
  {
    id: 4,
    title: 'Разработка программного обеспечения/сайта',
    description:
      'Происходит верстка адаптивного интерфейса и реализация полного функционала программного обеспечения/сайта, с наполнением необходимой информацией и контентом. Как итог, получается полнофункциональная версия разработанного продукта.',
  },
  {
    id: 5,
    title: 'Тестирование и внедрение',
    description:
      'Происходят испытания программного обеспечения/сайта на разных устройствах и в разных браузерах, а также тестирование производительности, после чего происходит размещение на сервере или загрузка в магазин приложений.',
  },
  {
    id: 6,
    title: 'Интеграция сторонних сервисов и документирование',
    description:
      'Для расширения возможностей сайта необходимо выполнить интеграция со сторонними сервисами. Описывается программная документация для эксплуатации и сопровождения программного продукта.',
  },
]);
</script>
